# Вы можете расположить сценарий своей игры в этом файле.

# Определение персонажей игры.
define mika = Character('Mика', color="#c8ffc8")
define m_mika = Character(' ', color="#c8ffc8")
define nesnakomka = Character('Незнакомка', color="#f6fcf1")
define bomg = Character('Алкаш', color="#c3ccf8")

# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

# Игра начинается здесь:
label start:

    scene bg room

    show eileen happy
    "12"
    mika'''
    Иногда просто необходимо просто сесть и отдохнуть. {w}
    Меня конечно можно посчитать ленивым лодырем. {w}
    Но что вы хотите от человека которого только, что пырнули? 
    '''

    nesnakomka "Парень с тобой все нормально?"
    "Я повернулся"
    mika "Да, а что не видно? {w}Со мной все нормально..."
    m_mika"~ Это было лишним ~"
    "Успел подумать я и упал"
    "Девушка подбежала, увидев кровавую одежду, она моментально набрала \"112\". {w}Передав наши координаты незнакомка повернулась ко мне"
    "Я пробормотал"
    mika "Не поможет"
    "На ее глазах выступили слезы"
    nesnakomka "Где рана?"
    "Я убрал от живота руку"
    "Она все увидела сама"
    "Мой живот был вспорот, как консервная банка"
    "Девушка побледнела"
    nesnakomka "А перевязать? {w}Почему ты себя не перевязал? {w}Сними куртку я осмотрю, я на медика учусь. {w}Побыстрей."
    "Я слабо улыбнулся"
    mika "Ты хочешь чтобы я разделся перед девушкой? {w}Пожалуй предпочту сдохнуть одетым. {w}Да и руки не слушаются"
    "Повернув голову, я сплюнул накопившуюся во рту кровь"
    "В это время она начала сама раздевать меня, что то бормоча о том, что надо было раздеватся как бы перед доктором, а не перед девушкой"
    "Почему то стало тепло"
    m_mika "~ Как то я лоханулся... {w}Перед смертью даже сиськи не помацал... {w}Как то перед собой стыдно... ~"
    "Я закрыл глаза"



    return
